diy-dream/DCND/dcnd_nrf52840_board/s140/ses/main.c
    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[0], 1);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[1], 1);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code;
    err_code = nrf_drv_saadc_sample();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

void print_character_on_screen(uint8_t * p_data)
{
    int i = 0;

    //Clear the frame_buffer
    Paint_Clear(&paint, UNCOLORED);

    p_data[strlen(p_data) - 1] = '\0';

    uint8_t max = strlen(p_data)/MAX_LINE_CHARACTER;
    char line[MAX_LINE_CHARACTER + 1];
    memset(line, '\0', sizeof(line));

    if(max > MAX_LINE)
    {
        //Print lines except the last one
        for(i = 0; i < MAX_LINE; i++){
            strncpy(line, p_data + (MAX_LINE_CHARACTER * i), MAX_LINE_CHARACTER);
            Paint_DrawStringAt(&paint, 0, Y_INIT_POSITION + (Y_SPACE * line_counter), line, &Font24, COLORED);
            line_counter++;
        }
    }
    else
    {
        //Print lines except the last one
        for(i = 0; i < max; i++){
            strncpy(line, p_data + (MAX_LINE_CHARACTER * i), MAX_LINE_CHARACTER);
            Paint_DrawStringAt(&paint, 0, Y_INIT_POSITION + (Y_SPACE * line_counter), line, &Font24, COLORED);
            line_counter++;
        }
    
        //Print the last line
        char end_line[MAX_LINE_CHARACTER + 1];
        memset(end_line, '\0', sizeof(end_line));
        strncpy(end_line, p_data + (MAX_LINE_CHARACTER * i), strlen(p_data) - (MAX_LINE_CHARACTER * i));
        Paint_DrawStringAt(&paint, 0, Y_INIT_POSITION + (Y_SPACE * line_counter), end_line, &Font24, COLORED);
        line_counter++;
    }
    
    EPD_DisplayFrame(&epd, frame_buffer);
}

void dcnd_protocol_acknowledge(uint8_t * p_data)
{
    uint32_t err_code;
    //TODO
#if 0
    do
    {
        uint16_t length = (uint16_t)strlen(p_data);
        err_code = ble_nus_data_send(&m_nus, p_data, &length, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
    } while (err_code == NRF_ERROR_RESOURCES);
#endif
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }

        if(dcnd.state == IDLE_STATE)
        {
            dcnd_protocol_decode(&dcnd, p_evt->params.rx_data.p_data);
            if(dcnd.message_types == START_TRANSFER_MSG )
            {
                NRF_LOG_INFO("RECEIVED_DATA_MSG\n");
                dcnd.state = RECEIVED_DATA_MSG;
                memset (dcnd.message, '\0', MAX_LINE_CHARACTER * MAX_LINE);
                line_counter = 0;

                dcnd_protocol_acknowledge("RECEIVED_DATA_MSG ACKNOWLEDGE\n");
            }
            else if(dcnd.message_types == START_TRANSFER_IMG)
            {
                NRF_LOG_INFO("RECEIVED_DATA_IMG\n");
                dcnd.state = RECEIVED_DATA_IMG;
                memset (dcnd.message, '\0', MAX_LINE_CHARACTER * MAX_LINE);
            }
        }
        else if(dcnd.state == RECEIVED_DATA_MSG)
        {
            dcnd_protocol_decode(&dcnd, p_evt->params.rx_data.p_data);
            if(dcnd.message_types == STOP_TRANSFER_MSG)
            {
                NRF_LOG_INFO("IDLE_STATE\n");
                NRF_LOG_INFO("MSG_RECEIVED\n");
                dcnd.state = IDLE_STATE;
                print_character_on_screen(dcnd.message);

